# Core CLI tools
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "gh"
brew "helm"
brew "mas"
brew "mise"
brew "ripgrep"
brew "starship"

# AI and developer CLI tools
brew "gemini-cli"
brew "glow"
brew "gnupg"

# Project-specific developer tools
brew "cocoapods"
brew "ghcup"
brew "mingw-w64"
brew "protobuf"

# Applications
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "chatgpt-atlas"
cask "claude"
cask "codex"
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "openscad@snapshot"
cask "spotify"
cask "visual-studio-code"

# Mac App Store
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835

# Visual Studio Code extensions
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "k--kato.intellij-idea-keybindings"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "swiftlang.swift-vscode"
